In [216]:
import pandas as pd

data = {
'2021' : [1116, 12259, 16699, 65119],
'2020' : [628, 11075, 15695, 56013],
'2019' : [678,12700,15148,55443],
'2018' : [712, 13597, 16052, 56024],
'농지면적순위' : [4,3,2,1]
}
columns = ['농지면적순위', '2021', '2020', '2019', '2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

    농지면적순위   2021   2020   2019   2018
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [217]:
df.columns

Index(['농지면적순위', '2021', '2020', '2019', '2018'], dtype='object')

In [218]:
df.index

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [219]:
df.values

array([[    4,  1116,   628,   678,   712],
       [    3, 12259, 11075, 12700, 13597],
       [    2, 16699, 15695, 15148, 16052],
       [    1, 65119, 56013, 55443, 56024]], dtype=int64)

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [221]:
df.index.name = '지역'

In [222]:
df

    농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [223]:
df.columns.name = '특성'

In [224]:
df

특성  농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [225]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [226]:
# 시리즈는 낫어 넘버 나오면 자동으로 형변환이 일어남
pd.Series([1,2,3,4,None])

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [227]:
pd.Series([1,2,3,4,'s']) # 모든 객체가 같아야함.

0    1
1    2
2    3
3    4
4    s
dtype: object

In [228]:
# DataFrame 은 시리즈의 집합체

In [229]:
df['2018-2021 변화율'] = ((df['2021']-df['2018'])/df['2018']*100)

In [230]:
df

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
서울       4   1116    628    678    712      56.741573
부산       3  12259  11075  12700  13597      -9.840406
대구       2  16699  15695  15148  16052       4.030650
인천       1  65119  56013  55443  56024      16.234114

In [231]:
df = df[['2018','2019','2020','2021','농지면적순위','2018-2021 변화율']]
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [232]:
# df['2018-2021 변화율'] = df['2018-2021 변화율'].astype(int) >> int형으로 변환가능
df.T # 전치하는 명령어

지역                      서울            부산           대구            인천
특성
2018            712.000000  13597.000000  16052.00000  56024.000000
2019            678.000000  12700.000000  15148.00000  55443.000000
2020            628.000000  11075.000000  15695.00000  56013.000000
2021           1116.000000  12259.000000  16699.00000  65119.000000
농지면적순위            4.000000      3.000000      2.00000      1.000000
2018-2021 변화율    56.741573     -9.840406      4.03065     16.234114

In [233]:
df['2018']

지역
서울      712
부산    13597
대구    16052
인천    56024
Name: 2018, dtype: int64

In [234]:
df['2018']['서울']

712

In [235]:
type(df['2021'])

pandas.core.series.Series

In [236]:
print(df['2021']['서울'])
print(df['2021'][0])

1116
1116

In [237]:
df.sort_values(by='2018-2021 변화율') # 해당 값으로 정렬 가능

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114
서울    712    678    628   1116       4      56.741573

In [238]:
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [239]:
# 슬라이싱
df[:2] # 서울과 부산만 가져오기 (0번째 1번째 가져오기)

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406

In [240]:
df['서울':'부산']

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406

In [241]:
#loc, iloc
df.loc['부산']

특성
2018             13597.000000
2019             12700.000000
2020             11075.000000
2021             12259.000000
농지면적순위               3.000000
2018-2021 변화율       -9.840406
Name: 부산, dtype: float64

In [242]:
df.loc[['부산']]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3      -9.840406

In [243]:
df.loc[['부산','대구']]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650

In [244]:
df.iloc[0] # 인덱스록

특성
2018              712.000000
2019              678.000000
2020              628.000000
2021             1116.000000
농지면적순위              4.000000
2018-2021 변화율      56.741573
Name: 서울, dtype: float64

In [245]:
df.iloc[0,0]

712

In [246]:
df.iloc[0][0]

712.0

In [247]:
df.iloc[[0]]

특성  2018  2019  2020  2021  농지면적순위  2018-2021 변화율
지역
서울   712   678   628  1116       4      56.741573

In [248]:
df.iloc[[0,1]]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406

# 실습
1. 인덱스는 학생 5명(철수, 영희, 길동, 슬기)
2. 컬럼은 4개(국어, 영어, 수학, 과학)

a. 순서대로 국어 영어 수학 과학

b. 철수 : 80, 90, 70, 30

c. 영희 : 90, 50, 100, 50

d. 길동 : 70, 60, 50, 80

e. 슬기 : 50, 100, 70, 80

3. 해당 데이터로 데이터 프레임 생성
4. 각 학생들의 과목 평균 column 추가
5. 과목별 평균 추가

In [249]:
index = ['철수','영희','길동','슬기']
columns = ['국어','영어','수학','과학']
data = {
    '국어' : [80,90,70,50],
    '영어' : [90,50,60,100],
    '수학' : [70,100,50,70],
    '과학' : [30,50,80,80]
}
df_p1 = pd.DataFrame(data, index=index, columns=columns)

In [250]:
df_p1

    국어   영어   수학  과학
철수  80   90   70  30
영희  90   50  100  50
길동  70   60   50  80
슬기  50  100   70  80

In [251]:
df_p1['평균'] = df_p1.mean(axis=1)

In [252]:
df_p1.loc['평균'] = df_p1.mean()

In [253]:
df_p1

      국어     영어     수학    과학    평균
철수  80.0   90.0   70.0  30.0  67.5
영희  90.0   50.0  100.0  50.0  72.5
길동  70.0   60.0   50.0  80.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0
평균  72.5   75.0   72.5  60.0  70.0

In [254]:
(df_p1['국어'] + df_p1['영어'] + df_p1['수학'] + df_p1['과학']) / 4

철수    67.5
영희    72.5
길동    65.0
슬기    75.0
평균    70.0
dtype: float64

In [255]:
df_p1['학생평균'] = (df_p1['국어'] + df_p1['영어'] + df_p1['수학'] + df_p1['과학']) / 4

In [256]:
df_p1

      국어     영어     수학    과학    평균  학생평균
철수  80.0   90.0   70.0  30.0  67.5  67.5
영희  90.0   50.0  100.0  50.0  72.5  72.5
길동  70.0   60.0   50.0  80.0  65.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0  75.0
평균  72.5   75.0   72.5  60.0  70.0  70.0

In [257]:
df_p1.loc['과목평균'] = (df_p1.loc['철수'] + df_p1.loc['영희'] + df_p1.loc['길동'] + df_p1.loc['슬기']) / 4

In [258]:
df_p1

        국어     영어     수학    과학    평균  학생평균
철수    80.0   90.0   70.0  30.0  67.5  67.5
영희    90.0   50.0  100.0  50.0  72.5  72.5
길동    70.0   60.0   50.0  80.0  65.0  65.0
슬기    50.0  100.0   70.0  80.0  75.0  75.0
평균    72.5   75.0   72.5  60.0  70.0  70.0
과목평균  72.5   75.0   72.5  60.0  70.0  70.0